In [1]:
import pandas as pd

In [2]:
ascent = pd.read_csv("/Users/liuhan/Desktop/吴思凡/MPP_Study/Fall2022/Data Visualization/final_data/ascent_sports.csv")

/var/folders/x9/qmhspxx972n6z0l4hkq9yt5m0000gn/T/ipykernel_50351/3694750507.py:1: DtypeWarning: Columns (0,22) have mixed types. Specify dtype option on import or set low_memory=False.
  ascent = pd.read_csv("/Users/liuhan/Desktop/吴思凡/MPP_Study/Fall2022/Data Visualization/final_data/ascent_sports.csv")

In [3]:
ascent.head(5)

,Unnamed: 0,id,user_id,grade_id,notes,raw_notes,method_id,climb_type,total_score,date,...,country,comment,rating,description,yellow_id,climb_try,repeat,exclude_from_ranking,user_recommended,chipped
0,0,2,1.0,36,NaN,0,3,0,545,918342000.0,...,THA,Thailand\n,0.0,NaN,255.0,0.0,0.0,0.0,0.0,0.0
1,1,3,1.0,36,NaN,0,3,0,545,925509600.0,...,NaN,\n,0.0,NaN,0.0,0.0,0.0,0.0,0.0,0.0
2,2,4,1.0,36,NaN,0,3,0,545,933026400.0,...,SWE,\n,0.0,NaN,255.0,0.0,0.0,0.0,0.0,0.0
3,3,5,1.0,36,NaN,0,3,0,545,933026400.0,...,SWE,\n,0.0,NaN,255.0,0.0,0.0,0.0,0.0,0.0
4,4,6,1.0,36,NaN,0,3,0,545,933458400.0,...,NaN,\n,0.0,NaN,0.0,0.0,0.0,0.0,0.0,0.0

In [4]:
user = pd.read_csv("/Users/liuhan/Desktop/吴思凡/MPP_Study/Fall2022/Data Visualization/final_data/user.csv")

/var/folders/x9/qmhspxx972n6z0l4hkq9yt5m0000gn/T/ipykernel_18615/3468148086.py:1: DtypeWarning: Columns (15) have mixed types. Specify dtype option on import or set low_memory=False.
  user = pd.read_csv("/Users/liuhan/Desktop/吴思凡/MPP_Study/Fall2022/Data Visualization/final_data/user.csv")

In [5]:
user.head()

,id,first_name,last_name,city,country,sex,height,weight,started,competitions,...,sponsor2,sponsor3,best_area,worst_area,guide_area,interests,birth,presentation,deactivated,anonymous
0,1,first,last,Göteborg,SWE,0,177,73,1996,NaN,...,NaN,NaN,"Railay beach, Krabi, Thailand",NaN,NaN,NaN,1976-03-10,NaN,0,0
1,2,first,last,stockholm,SWE,0,0,0,2000,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0,0
2,3,first,last,Umeå,SWE,0,180,78,1995,NaN,...,NaN,NaN,Hell,Umeå,NaN,NaN,1973-09-09,NaN,0,0
3,4,first,last,Goteborg,SWE,1,165,58,2001,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,1984-07-26,NaN,0,0
4,5,first,last,North Attleboro,USA,0,0,0,1991,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,1969-05-07,NaN,0,0

In [6]:
# User account not “deactivated”
user_clean=user.loc[user.deactivated!=1]

In [7]:
# Restricted sex to “male-0” or “female-1”
user_clean=user_clean.loc[(user_clean["sex"]==0) | (user_clean["sex"]==1)]

In [8]:
# Weight had to be > 0 kg (lots of 0's)
user_clean=user_clean.loc[user_clean.weight!=0]

In [9]:
user_clean=user_clean.loc[(user_clean.height>122) | (user_clean.height<213)]

In [11]:
user_clean_USA=user_clean.loc[user_clean["country"]=="USA"]

In [12]:
user_clean_USA=user_clean_USA.loc[user_clean_USA.city!="??"]

In [13]:
# list of major cities in USA
usa_city = ["Aberdeen", "Abilene", "Akron", "Albany", "Albuquerque", "Alexandria", "Allentown", "Amarillo", "Anaheim", "Anchorage", "Ann Arbor", "Antioch", "Apple Valley", "Appleton", "Arlington", "Arvada", "Asheville", "Athens", "Atlanta", "Atlantic City", "Augusta", "Aurora", "Austin", "Bakersfield", "Baltimore", "Barnstable", "Baton Rouge", "Beaumont", "Bel Air", "Bellevue", "Berkeley", "Bethlehem", "Billings", "Birmingham", "Bloomington", "Boise", "Boise City", "Bonita Springs", "Boston", "Boulder", "Bradenton", "Bremerton", "Bridgeport", "Brighton", "Brownsville", "Bryan", "Buffalo", "Burbank", "Burlington", "Cambridge", "Canton", "Cape Coral", "Carrollton", "Cary", "Cathedral City", "Cedar Rapids", "Champaign", "Chandler", "Charleston", "Charlotte", "Chattanooga", "Chesapeake", "Chicago", "Chula Vista", "Cincinnati", "Clarke County", "Clarksville", "Clearwater", "Cleveland", "College Station", "Colorado Springs", "Columbia", "Columbus", "Concord", "Coral Springs", "Corona", "Corpus Christi", "Costa Mesa", "Dallas", "Daly City", "Danbury", "Davenport", "Davidson County", "Dayton", "Daytona Beach", "Deltona", "Denton", "Denver", "Des Moines", "Detroit", "Downey", "Duluth", "Durham", "El Monte", "El Paso", "Elizabeth", "Elk Grove", "Elkhart", "Erie", "Escondido", "Eugene", "Evansville", "Fairfield", "Fargo", "Fayetteville", "Fitchburg", "Flint", "Fontana", "Fort Collins", "Fort Lauderdale", "Fort Smith", "Fort Walton Beach", "Fort Wayne", "Fort Worth", "Frederick", "Fremont", "Fresno", "Fullerton", "Gainesville", "Garden Grove", "Garland", "Gastonia", "Gilbert", "Glendale", "Grand Prairie", "Grand Rapids", "Grayslake", "Green Bay", "GreenBay", "Greensboro", "Greenville", "Gulfport-Biloxi", "Hagerstown", "Hampton", "Harlingen", "Harrisburg", "Hartford", "Havre de Grace", "Hayward", "Hemet", "Henderson", "Hesperia", "Hialeah", "Hickory", "High Point", "Hollywood", "Honolulu", "Houma", "Houston", "Howell", "Huntington", "Huntington Beach", "Huntsville", "Independence", "Indianapolis", "Inglewood", "Irvine", "Irving", "Jackson", "Jacksonville", "Jefferson", "Jersey City", "Johnson City", "Joliet", "Kailua", "Kalamazoo", "Kaneohe", "Kansas City", "Kennewick", "Kenosha", "Killeen", "Kissimmee", "Knoxville", "Lacey", "Lafayette", "Lake Charles", "Lakeland", "Lakewood", "Lancaster", "Lansing", "Laredo", "Las Cruces", "Las Vegas", "Layton", "Leominster", "Lewisville", "Lexington", "Lincoln", "Little Rock", "Long Beach", "Lorain", "Los Angeles", "Louisville", "Lowell", "Lubbock", "Macon", "Madison", "Manchester", "Marina", "Marysville", "McAllen", "McHenry", "Medford", "Melbourne", "Memphis", "Merced", "Mesa", "Mesquite", "Miami", "Milwaukee", "Minneapolis", "Miramar", "Mission Viejo", "Mobile", "Modesto", "Monroe", "Monterey", "Montgomery", "Moreno Valley", "Murfreesboro", "Murrieta", "Muskegon", "Myrtle Beach", "Naperville", "Naples", "Nashua", "Nashville", "New Bedford", "New Haven", "New London", "New Orleans", "New York", "New York City", "Newark", "Newburgh", "Newport News", "Norfolk", "Normal", "Norman", "North Charleston", "North Las Vegas", "North Port", "Norwalk", "Norwich", "Oakland", "Ocala", "Oceanside", "Odessa", "Ogden", "Oklahoma City", "Olathe", "Olympia", "Omaha", "Ontario", "Orange", "Orem", "Orlando", "Overland Park", "Oxnard", "Palm Bay", "Palm Springs", "Palmdale", "Panama City", "Pasadena", "Paterson", "Pembroke Pines", "Pensacola", "Peoria", "Philadelphia", "Phoenix", "Pittsburgh", "Plano", "Pomona", "Pompano Beach", "Port Arthur", "Port Orange", "Port Saint Lucie", "Port St. Lucie", "Portland", "Portsmouth", "Poughkeepsie", "Providence", "Provo", "Pueblo", "Punta Gorda", "Racine", "Raleigh", "Rancho Cucamonga", "Reading", "Redding", "Reno", "Richland", "Richmond", "Richmond County", "Riverside", "Roanoke", "Rochester", "Rockford", "Roseville", "Round Lake Beach", "Sacramento", "Saginaw", "Saint Louis", "Saint Paul", "Saint Petersburg", "Salem", "Salinas", "Salt Lake City", "San Antonio", "San Bernardino", "San Buenaventura", "San Diego", "San Francisco", "San Jose", "Santa Ana", "Santa Barbara", "Santa Clara", "Santa Clarita", "Santa Cruz", "Santa Maria", "Santa Rosa", "Sarasota", "Savannah", "Scottsdale", "Scranton", "Seaside", "Seattle", "Sebastian", "Shreveport", "Simi Valley", "Sioux City", "Sioux Falls", "South Bend", "South Lyon", "Spartanburg", "Spokane", "Springdale", "Springfield", "St. Louis", "St. Paul", "St. Petersburg", "Stamford", "Sterling Heights", "Stockton", "Sunnyvale", "Syracuse", "Tacoma", "Tallahassee", "Tampa", "Temecula", "Tempe", "Thornton", "Thousand Oaks", "Toledo", "Topeka", "Torrance", "Trenton", "Tucson", "Tulsa", "Tuscaloosa", "Tyler", "Utica", "Vallejo", "Vancouver", "Vero Beach", "Victorville", "Virginia Beach", "Visalia", "Waco", "Warren", "Washington", "Waterbury", "Waterloo", "West Covina", "West Valley City", "Westminster", "Wichita", "Wilmington", "Winston", "Winter Haven", "Worcester", "Yakima", "Yonkers", "York", "Youngstown"]

In [14]:
# select data from major cities
user_clean_USA=user_clean_USA[user_clean_USA.city.isin(usa_city)]

In [15]:
user_clean_USA = pd.DataFrame.reset_index(user_clean_USA)

In [16]:
user_clean_USA.columns

Index(['index', 'id', 'first_name', 'last_name', 'city', 'country', 'sex',
       'height', 'weight', 'started', 'competitions', 'occupation', 'sponsor1',
       'sponsor2', 'sponsor3', 'best_area', 'worst_area', 'guide_area',
       'interests', 'birth', 'presentation', 'deactivated', 'anonymous'],
      dtype='object')

In [17]:
user_clean_USA=user_clean_USA[["id", "city", "country", "sex", "height", "weight"]]

In [18]:
user_clean_USA=user_clean_USA.rename(columns={'id': 'user_id'})

In [20]:
user_clean_USA.to_csv('user_USA_cleaned.csv')

In [21]:
ascent_clean=ascent.rename(columns={'id': 'ascent_id'})

In [27]:
ascent_clean=ascent_clean[['ascent_id', 'user_id', 'grade_id', 'total_score']]

In [30]:
grade = pd.read_csv("/Users/liuhan/Desktop/吴思凡/MPP_Study/Fall2022/Data Visualization/final_data/grade.csv")

In [31]:
grade = grade.rename(columns={'id': 'grade_id'})

In [32]:
grade = grade[['grade_id', 'usa_routes']].dropna()

In [40]:
viz_data = (ascent_clean.merge(grade, left_on = 'grade_id', right_on = 'grade_id', how = 'left')
.merge(user_clean_USA, left_on = 'user_id',right_on ='user_id', how = 'right'))

In [41]:
viz_data = viz_data.dropna()

In [43]:
viz_data.to_csv('viz_data.csv')

In [5]:
viz_data = pd.read_csv("/Users/liuhan/CAPP30239_FA22/data/viz_data.csv")

In [6]:
viz_data.head()

,Unnamed: 0,ascent_id,user_id,grade_id,total_score,usa_routes,city,country,sex,height,weight
0,1,1144991.0,61.0,57.0,900.0,5.12d,Philadelphia,USA,0,0,73
1,2,1259657.0,61.0,57.0,900.0,5.12d,Philadelphia,USA,0,0,73
2,3,1259658.0,61.0,57.0,900.0,5.12d,Philadelphia,USA,0,0,73
3,5,1041.0,65.0,57.0,900.0,5.12d,Salt Lake City,USA,0,0,68
4,6,1042.0,65.0,57.0,900.0,5.12d,Salt Lake City,USA,0,0,68

In [12]:
difficulty = viz_data['usa_routes'].value_counts()

In [14]:
difficulty = difficulty.to_frame()

In [16]:
difficulty.to_csv('difficulty_distribution.csv')

In [22]:
highest_grade = viz_data[['user_id','grade_id', 'usa_routes', 'sex']]

In [29]:
highest_grade = highest_grade.groupby('user_id').max('grade_id').reset_index()

In [33]:
highest_grade = highest_grade.merge(grade, left_on = 'grade_id', right_on = 'grade_id', how = 'left')

      user_id  grade_id  sex usa_routes
0        61.0      57.0    0      5.12d
1        65.0      64.0    0      5.13c
2        66.0      62.0    0      5.13b
3        69.0      62.0    0      5.13b
4       134.0      70.0    0      5.14b
...       ...       ...  ...        ...
1399  66475.0      68.0    0      5.14a
1400  66619.0      51.0    0      5.12a
1401  66631.0      66.0    0      5.13d
1402  66703.0      55.0    0      5.12c
1403  66832.0      62.0    0      5.13b

[1404 rows x 4 columns]

In [36]:
def sex(x):
    if x == 0:
        return 'male'
    else:
        return 'female'

highest_grade['sex_name']= highest_grade['sex'].apply(sex)
highest_grade

      user_id  grade_id  sex usa_routes sex_name
0        61.0      57.0    0      5.12d     male
1        65.0      64.0    0      5.13c     male
2        66.0      62.0    0      5.13b     male
3        69.0      62.0    0      5.13b     male
4       134.0      70.0    0      5.14b     male
...       ...       ...  ...        ...      ...
1399  66475.0      68.0    0      5.14a     male
1400  66619.0      51.0    0      5.12a     male
1401  66631.0      66.0    0      5.13d     male
1402  66703.0      55.0    0      5.12c     male
1403  66832.0      62.0    0      5.13b     male

[1404 rows x 5 columns]

In [37]:
highest_grade.to_csv('highest_grade.csv')

In [62]:
bmi_grade = highest_grade.merge(viz_data[['user_id','height', 'weight']],on = 'user_id', how = 'left')
bmi_grade = bmi_grade.groupby('user_id').max(['height', 'weight']).reset_index()

In [63]:
bmi_grade = bmi_grade.loc[bmi_grade['height'] != 0]
bmi_grade['bmi'] = bmi_grade['weight']/(bmi_grade['height']/100)**2

In [64]:
bmi_grade

      user_id  grade_id  sex  height  weight         bmi
3        69.0      62.0    0     183      73   21.798202
4       134.0      70.0    0      71      68  134.893870
5       160.0      55.0    0     190      83   22.991690
6       215.0      68.0    0     174      73   24.111507
7       312.0      59.0    0     180      73   22.530864
...       ...       ...  ...     ...     ...         ...
1399  66475.0      68.0    0     189      68   19.036421
1400  66619.0      51.0    0     183      73   21.798202
1401  66631.0      66.0    0     180      68   20.987654
1402  66703.0      55.0    0     172      63   21.295295
1403  66832.0      62.0    0     181      68   20.756387

[1034 rows x 6 columns]